# 1913 Restaurant Data
Goal: Create a set of uniform code for cleaning up the street names and street numbers.

In [1]:
import pandas as pd

## Master

In [2]:
DF = pd.read_csv('datasets/1880_streets_full.csv')
DF.head(1)

,street_name,odd_on,avg_direction,building_num_range,start_end_coordinates,segment_length,segment_direction,building_num_range_length,avg_length_per_building,direction_deviation,road_type,offset_from_road_center
0,10th Avenue,left,-170.561731,"[1, 19]","[[40.741073, -74.009227], [40.739952, -74.0094...",126.194091,-170.561731,19,6.641794,0.0,Avenue,10

In [3]:
DF['street_name'].value_counts()

10th Avenue            164
8th Avenue             148
2nd Avenue             129
5th Avenue             129
3rd Avenue             126
                      ...
Wards Island             1
Hall Place               1
Gay Street               1
Mac Dougal Alley         1
Centre Market Place      1
Name: street_name, Length: 666, dtype: int64

In [4]:
master_list = list(dict(DF['street_name'].value_counts()).keys())
#sorted(master_list)

## 1913

In [5]:
df1 = pd.read_csv('datasets/1913Final.csv')
df1.head()

,Year,PG,ID,ID2,CAT_ORG,FULL,Position,Nation,Name,NATIONALITY,...,region_api,prob1_api,prob2_api,>40,match_country,nation,countries match,regions match,"name error (""Y"" if the first and last columns are not valid names. i.e. ""Smith's Inc."")","useable last name (if entered ""Y"" in the previous column, enter the last name contained in the restaurant name if applicable. i.e. for ""Smith's Restaurant"", please enter ""Smith"")"
0,1913_TrowBusMan,904,33,1913_TrowBusMan_33,Restaurants,"Albanian Roumanian Co, 261 W37th",23,NaN,Albanian Roumanian Co,Albanian,...,Eastern Europe,0.494082,0.479671,1,FALSE,NaN,FALSE,FALSE,NaN,NaN
1,1913_TrowBusMan,908,1161,1913_TrowBusMan_1161,Restaurants,Garbade Emily D. 78 W Houston,17,NaN,Garbade Emily D,American,...,Northern Europe,0.477784,0.651728,1,FALSE,German,FALSE,FALSE,NaN,NaN
2,1913_TrowBusMan,908,1124,1913_TrowBusMan_1124,Restaurants,"Frese Ida L, 2 W33d",13,NaN,Frese Ida L,"American, German",...,Western Asia,0.510736,0.573118,1,FALSE,Italy,FALSE,German Jew,NaN,NaN
3,1913_TrowBusMan,905,77,1913_TrowBusMan_77,Restaurants,"Aram Ada. 1902, 7th av",10,NaN,Aram Ada,Armenian,...,Western Africa,0.477573,0.442362,1,FALSE,Turkey,FALSE,FALSE,NaN,NaN
4,1913_TrowBusMan,906,430,1913_TrowBusMan_430,Restaurants,"Cafe Safran, 265, 4th av",13,NaN,Cafe Safran,Armenian,...,Northern Europe,0.679962,0.68712,1,FALSE,NaN,FALSE,FALSE,Y,Safran

In [6]:
df1.shape

(5419, 36)

In [7]:
df1.columns

Index(['Year', 'PG', 'ID', 'ID2', 'CAT_ORG', 'FULL', 'Position', 'Nation',
       'Name', 'NATIONALITY', 'NATIONALITY final', 'GENDER', 'Gender_api',
       'Gender_same', 'gender_final', 'ST Name', 'ST Name 2', 'ST Name 3',
       'ST Name 4', 'ST Name 5', 'ST Name 6', 'First', 'Last', 'country1_api',
       'country2_api', 'score_api', 'region_api', 'prob1_api', 'prob2_api',
       '>40', 'match_country', 'nation', 'countries match', 'regions match',
       'name error ("Y" if the first and last columns are not valid names. i.e. "Smith's Inc.")',
       'useable last name (if entered "Y" in the previous column, enter the last name contained in the restaurant name if applicable. i.e. for "Smith's Restaurant", please enter "Smith")'],
      dtype='object')

Get the columns I need.

In [8]:
df1 = df1[['FULL', 'Name', 'gender_final', 'countries match', 'regions match']]
df1.head()

,FULL,Name,gender_final,countries match,regions match
0,"Albanian Roumanian Co, 261 W37th",Albanian Roumanian Co,Unknown,FALSE,FALSE
1,Garbade Emily D. 78 W Houston,Garbade Emily D,f,FALSE,FALSE
2,"Frese Ida L, 2 W33d",Frese Ida L,f,FALSE,German Jew
3,"Aram Ada. 1902, 7th av",Aram Ada,f,FALSE,FALSE
4,"Cafe Safran, 265, 4th av",Cafe Safran,Unknown,FALSE,FALSE

In [9]:
df2 = pd.read_csv('datasets/1913TrowBus.csv')
df2.head()

,Year,PG,ID,ID2,CAT_ORG,FULL,Position,Nation,Name,NATIONALITY,...,Addy_Clean,Address,CORNER,ST combi,ST Name,ST Name 2,ST Name 3,ST Name 4,ST Name 5,ST Name 6
0,1913_TrowBusMan,904,33,1913_TrowBusMan_33,Restaurants,"Albanian Roumanian Co, 261 W37th",23,NaN,Albanian Roumanian Co,Albanian,...,261 W 37th,261 W37th,N,W 37th,261,W37th,NaN,NaN,NaN,NaN
1,1913_TrowBusMan,908,1161,1913_TrowBusMan_1161,Restaurants,Garbade Emily D. 78 W Houston,17,NaN,Garbade Emily D,American,...,78 W Houston,78 W Houston,N,W Houston,78,W,Houston,NaN,NaN,NaN
2,1913_TrowBusMan,908,1124,1913_TrowBusMan_1124,Restaurants,"Frese Ida L, 2 W33d",13,NaN,Frese Ida L,"American, German",...,2 W 33rd,2 W33d,N,W 33rd,2,W33d,NaN,NaN,NaN,NaN
3,1913_TrowBusMan,905,77,1913_TrowBusMan_77,Restaurants,"Aram Ada. 1902, 7th av",10,NaN,Aram Ada,Armenian,...,1902 7th av,"1902, 7th av",N,7th av,1902,7th,av,NaN,NaN,NaN
4,1913_TrowBusMan,906,430,1913_TrowBusMan_430,Restaurants,"Cafe Safran, 265, 4th av",13,NaN,Cafe Safran,Armenian,...,265 4th av,"265, 4th av",N,4th av,265,4th,av,NaN,NaN,NaN

In [10]:
df2.columns

Index(['Year', 'PG', 'ID', 'ID2', 'CAT_ORG', 'FULL', 'Position', 'Nation',
       'Name', 'NATIONALITY', 'NATIONALITY final', 'GENDER', 'Unnamed: 12',
       'Addy_Clean', 'Address', 'CORNER', 'ST combi', 'ST Name', 'ST Name 2',
       'ST Name 3', 'ST Name 4', 'ST Name 5', 'ST Name 6'],
      dtype='object')

In [11]:
df2 = df2[['FULL', 'Name', 'Addy_Clean', 'ST combi']]
df2.head()

,FULL,Name,Addy_Clean,ST combi
0,"Albanian Roumanian Co, 261 W37th",Albanian Roumanian Co,261 W 37th,W 37th
1,Garbade Emily D. 78 W Houston,Garbade Emily D,78 W Houston,W Houston
2,"Frese Ida L, 2 W33d",Frese Ida L,2 W 33rd,W 33rd
3,"Aram Ada. 1902, 7th av",Aram Ada,1902 7th av,7th av
4,"Cafe Safran, 265, 4th av",Cafe Safran,265 4th av,4th av

In [12]:
df = df2.merge(df1, on=['FULL', 'Name'])
df.head()

,FULL,Name,Addy_Clean,ST combi,gender_final,countries match,regions match
0,Ashton Frederica; 1306 Madison av,Ashton Frederica,1306 Madison av,Madison av,f,British,NaN
1,"Bowen & Turner, 502, 6th av",Bowen & Turner,502 6th av,6th av,m,FALSE,British
2,"Burke & Thomas, 451 Lenox av",Burke & Thomas,451 Lenox av,Lenox av,m,Irish,NaN
3,"Pedersen O. Anker, 645 W42d",Pedersen O Anker,645 W 42nd,W 42nd,m,Norwegian,FALSE
4,Boat House Restaurant. E182d Boston rd,Boat House Restaurant E,182d Boston rd,Boston rd,Unknown,FALSE,FALSE

In [13]:
df.columns = ['full', 'name', 'address', 'street', 'gender', 'country', 'region']
df.head(1)

,full,name,address,street,gender,country,region
0,Ashton Frederica; 1306 Madison av,Ashton Frederica,1306 Madison av,Madison av,f,British,NaN

In [14]:
df['num'] = df['address'].str.split().str[0]
df.head(1)

,full,name,address,street,gender,country,region,num
0,Ashton Frederica; 1306 Madison av,Ashton Frederica,1306 Madison av,Madison av,f,British,NaN,1306

### Street

### systematic cleaning

#### strip unnecessary white spaces

In [15]:
df['street_clean'] = df['street'].str.strip()
df.head(1)

,full,name,address,street,gender,country,region,num,street_clean
0,Ashton Frederica; 1306 Madison av,Ashton Frederica,1306 Madison av,Madison av,f,British,NaN,1306,Madison av

Inspect `street_clean` data.

In [16]:
st = dict(df['street_clean'].value_counts())
#sorted(st.items())

#### add "street" after "E xxth" or "W xxth"

In [17]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x+' Street' if x.startswith('E ') | x.startswith('W ') else x)
df.head(1)

,full,name,address,street,gender,country,region,num,street_clean
0,Ashton Frederica; 1306 Madison av,Ashton Frederica,1306 Madison av,Madison av,f,British,NaN,1306,Madison av

In [18]:
st = dict(df['street_clean'].value_counts())
#sorted(st.items())

#### replace abbreviation with full names.

In [19]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' st', ' Street') if x.endswith(' st') else x)

In [20]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' St', ' Street') if x.endswith(' St') else x)

In [21]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' av', ' Avenue') if x.endswith(' av') else x)

In [22]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' pl', ' Place') if x.endswith(' pl') else x)

In [23]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' mkt', ' Market') if x.endswith(' mkt') else x)

In [24]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' ln', ' Lane') if x.endswith(' ln') else x)

In [25]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' sq', ' Square') if x.endswith(' sq') else x)

In [26]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' slip', ' Slip') if x.endswith(' slip') else x)

In [27]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' sl', ' Slip') if x.endswith(' sl') else x)

In [28]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' pkway', ' Parkway') if x.endswith(' pkway') else x)

In [29]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' rd', ' Road') if x.endswith(' rd') else x)

In [30]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x.replace(' pk', ' Park') if x.endswith(' pk') else x)

In [31]:
st = dict(df['street_clean'].value_counts())
#sorted(st.items())

#### add "street" to all the ones with only one word

In [32]:
df['street_clean'] = df['street_clean'].apply(
    lambda x: x+' Street' if len(x.split())==1 else x)

In [33]:
st = dict(df['street_clean'].value_counts())
#sorted(st.items())

### cross check results

In [34]:
streets_list = list(dict(df['street_clean'].value_counts()).keys())
streets_list[:5]

['3rd Avenue', 'Ave C', 'Delancey Street', 'W 42nd Street', 'Boston Road']

In [35]:
for street in streets_list:
    if street not in master_list:
        print(street)

Ave C
Boston Road
Lenox Avenue

### manual cleaning

In [36]:
STREET = {
    # unmatched
    # 123rd Street
    # W 8th Street
    # W 22th Street
    # W 18st Street
    # E 100th Street
    # E 101st Street
    # E 102nd Street
    # E 137th Street
    # E 138th Street
    # E 143rd Street
    # E 148th Street
    # E 149th Street
    # E 150th Street
    # E 151st Street
    # E 155th Street
    # E 158th Street
    # E 160th Street
    # E 161st Street
    # E 163rd Street
    # E 165th Street
    # E 169th Street
    # E 174th Street
    # E 180th Street
    # E 183rd Street
    # E 187th Street
    
    # street added wrongly
    '1st Street': '1st Avenue',
    '2nd Street': '2nd Avenue',
    '3 Avenue': '3rd Avenue',
    'c 3rd Avenue': '3rd Avenue',
    '3rd Street': '3rd Avenue',
    '5th Street': '5th Avenue',
    '6th Street': '6th Avenue',
    '7th Street': '7th Avenue',
    '8th Street': '8th Avenue',
    '8d Avenue': '8th Avenue',
    '9th Street': '9th Avenue',
    'Broadway Street': 'Broadway',
    
    # direction order
    'W Broadway Street': 'Broadway W',
    'E Broadway Street': 'Broadway E',
    'W Houston Street': 'Houston Street W',
    'E Houston Street': 'Houston Street E',
    'N Moore': 'Moore Street N',
    'S William': 'William Street S',
    'N William': 'William Street N',
    'Union sq E': 'Union Square E',
    'Little W 12th': 'W 12th Street',
    'E 145th Street': 'E 145th Street',
    
    # title case
    'Park row': 'Park Row',
    'James slip': 'James Slip',
    'Old slip': 'Old Slip',
    'Catherine slip': 'Catherine Slip',
    'Peck slip'
    
    # order
    'Av A': 'A Avenue',
    'Ave A': 'A Avenue',
    'Av B': 'B Avenue',
    'Ave B': 'B Avenue',
    'Av C': 'C Avenue',
    'Ave C': 'C Avenue',
    'av c W': 'C Avenue',
    'Av D': 'D Avenue',
    'Ave D': 'D Avenue',
    'av n E': 'East Avenue',
    'av n W': 'West Avenue',
    'W End av Street': 'West Avenue',
    'W End Av Street': 'West Avenue',
    
    # same name
    'Centre Market': 'Centre Market Place',
    'Clinton Market': 'Clinton Place',
    'Chatham Square': 'Chatham Street',
    'Catherine Market': 'Catherine Street',
    'Fulton Market': 'Fulton Street',
    'Grand st Circle': 'Grand Street',
    'Jefferson Market': 'Jefferson Street',
    'Stone William': 'Stone Street',
    'Tompkins Market': 'Tompkins Street',
    'Washington Market': 'Washington Place',
    'Hanover Square': 'Hanover Street',
    'New Chambers': 'New Chambers Street',
    'Thompson Avenue': 'Thompson Street',
    'Union Avenue': 'Union Square',
    'Lexington Street': 'Lexington Avenue',
    'Morris pk Avenue': 'Morris Street',
    
    # different spelling
    'Macdougal Street': 'Mac Dougal Street',
    'St Mark’s Place': 'Saint Marks Place',
    'St Mark\'s Place': 'Saint Marks Place',
    'VandeWater Street': 'Vandewater Street',
    'Riverside drive': 'Riverside Driveway',
    'Newell Avenue': 'New Avenue',
    'Washington sq E': 'Washington Square E',
    'Washington sq W': 'Washington Square W',
    'Washington sq S': 'Washington Square S',
    'Waverley Place': 'Waverly Place',
    'Hamilton Place': 'Hamilton Street',
    'Morris Avenue': 'Morris Street',
    'Courtlandt Avenue': 'Courtlandt Street',
    'Lafayette Street': 'Lafayette Place',
    'Boston Road': 'Bolton Road',
    'Washington Avenue': 'Washington Street',
    'Burling Street': 'Burling Slip'
    
    
    # unmatched avenues
    # Alex Avenue
    # Amsterdam Avenue
    # Lincoln Avenue
    # Tremont Avenue
    # Brook Avenue
    # Willis Avenue
    # Columbus Avenue
    # Bergen Avenue
    # Hughes Avenue
    # Claremont Avenue
    # Clay Avenue
    # Bathgate Avenue
    # Forest Avenue
    # Pleasant Avenue
    # Cypress Avenue
    # Edgecombe Avenue
    # Ogden Avenue
    # Longwood Avenue
    # Belmont Avenue
    # Villa Avenue
    # Arthur Avenue
    # Wilkins Avenue
    # Tremont Avenue
    # Jerome Avenue
    # Lenox Avenue
    # Westchester Avenue
    # Prospect Avenue
    # St Nicholas Avenue
    # Webster Avenue
    # Wendover Avenue
    # City Id Avenue
    # Melrose Avenue
    # Manhattan Avenue
    # St Ann's Avenue
    # Jerome Avenue
    
    # unmatched
    # Trinity Place
    # Bible h
    # Home Street
    # Columbus Circle
    # Central pk W
    # E End av Street
    # Little W12th
    # Gt Jones
    # Westchester Square
    # Freeman Street
    # Central pk S
    # Harlem Market
    # Trinity Place
    # Ditmars City Id
    # Central Station
    # Morningside drive
    # Fox Street
    # Macomb's Road
    # Cathedral Parkway
    # Cooper sq E
    # S Boulevard
    # E Tremont av Street
    # Marginal Street
    # Kenmare Street
    # E Fordham rd Street
    # White Plains Road
}

In [37]:
df = df.replace({'street_clean': STREET})
df.head(1)

,full,name,address,street,gender,country,region,num,street_clean
0,Ashton Frederica; 1306 Madison av,Ashton Frederica,1306 Madison av,Madison av,f,British,NaN,1306,Madison Avenue

In [38]:
streets_list = list(dict(df['street_clean'].value_counts()).keys())
streets_list[:5]

['3rd Avenue', 'C Avenue', 'Delancey Street', 'W 42nd Street', '6th Avenue']

### cross check results

In [39]:
for street in streets_list:
    if street not in master_list:
        print(street)

Lenox Avenue

### House Number

In [40]:
df['num_clean'] = df['num']
df.head(1)

,full,name,address,street,gender,country,region,num,street_clean,num_clean
0,Ashton Frederica; 1306 Madison av,Ashton Frederica,1306 Madison av,Madison av,f,British,NaN,1306,Madison Avenue,1306

In [41]:
no = dict(df['num_clean'].value_counts())
#sorted(no.items())

In [42]:
df['num_clean'] = df['num_clean'].apply(
    lambda x: x.replace('Grand', '0') if str(x).endswith('Grand') else x)

In [43]:
df['num_clean'] = df['num_clean'].apply(
    lambda x: x.replace('d', '') if str(x).endswith('d') else x)

In [44]:
df['num_clean'] = df['num_clean'].dropna().astype(str).astype(float).astype(int)

In [45]:
df.to_csv('cleaned/1913_address_CLEANED.csv')